# AnalyticalTransferSwitchData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalTransferSwitchData Methods
AnalyticalTransferSwitchData Class See Also
---
The AnalyticalTransferSwitchData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from AnalyticalDistributionNodePropertyData.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AnalyticalTransferSwitchData Class
Autodesk.Revit.DB.Electrical Namespace